{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"activation": "sigmoid", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "batch_input_shape": [null, 3], "name": "dense_10", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 12}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_11", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 12}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_8", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_12", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_9", "trainable": true}}]}